susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32WB3x.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2022-12-19T23:52:17.381058
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CM4_EVENTOUT_PA0_ PA0,GPIO_AF15
#define CM4_EVENTOUT_PA1_ PA1,GPIO_AF15
#define CM4_EVENTOUT_PA10_ PA10,GPIO_AF15
#define CM4_EVENTOUT_PA11_ PA11,GPIO_AF15
#define CM4_EVENTOUT_PA12_ PA12,GPIO_AF15
#define CM4_EVENTOUT_PA13_ PA13,GPIO_AF15
#define CM4_EVENTOUT_PA14_ PA14,GPIO_AF15
#define CM4_EVENTOUT_PA15_ PA15,GPIO_AF15
#define CM4_EVENTOUT_PA2_ PA2,GPIO_AF15
#define CM4_EVENTOUT_PA3_ PA3,GPIO_AF15
#define CM4_EVENTOUT_PA4_ PA4,GPIO_AF15
#define CM4_EVENTOUT_PA5_ PA5,GPIO_AF15
#define CM4_EVENTOUT_PA6_ PA6,GPIO_AF15
#define CM4_EVENTOUT_PA7_ PA7,GPIO_AF15
#define CM4_EVENTOUT_PA8_ PA8,GPIO_AF15
#define CM4_EVENTOUT_PA9_ PA9,GPIO_AF15
#define CM4_EVENTOUT_PB0_ PB0,GPIO_AF15
#define CM4_EVENTOUT_PB1_ PB1,GPIO_AF15
#define CM4_EVENTOUT_PB2_ PB2,GPIO_AF15
#define CM4_EVENTOUT_PB3_ PB3,GPIO_AF15
#define CM4_EVENTOUT_PB4_ PB4,GPIO_AF15
#define CM4_EVENTOUT_PB5_ PB5,GPIO_AF15
#define CM4_EVENTOUT_PB6_ PB6,GPIO_AF15
#define CM4_EVENTOUT_PB7_ PB7,GPIO_AF15
#define CM4_EVENTOUT_PB8_ PB8,GPIO_AF15
#define CM4_EVENTOUT_PB9_ PB9,GPIO_AF15
#define CM4_EVENTOUT_PC14_ PC14,GPIO_AF15
#define CM4_EVENTOUT_PC15_ PC15,GPIO_AF15
#define CM4_EVENTOUT_PE4_ PE4,GPIO_AF15
#define CM4_EVENTOUT_PH3_ PH3,GPIO_AF15
#define _CM4_EVENTOUT_PA0_ 1
#define _CM4_EVENTOUT_PA1_ 1
#define _CM4_EVENTOUT_PA10_ 1
#define _CM4_EVENTOUT_PA11_ 1
#define _CM4_EVENTOUT_PA12_ 1
#define _CM4_EVENTOUT_PA13_ 1
#define _CM4_EVENTOUT_PA14_ 1
#define _CM4_EVENTOUT_PA15_ 1
#define _CM4_EVENTOUT_PA2_ 1
#define _CM4_EVENTOUT_PA3_ 1
#define _CM4_EVENTOUT_PA4_ 1
#define _CM4_EVENTOUT_PA5_ 1
#define _CM4_EVENTOUT_PA6_ 1
#define _CM4_EVENTOUT_PA7_ 1
#define _CM4_EVENTOUT_PA8_ 1
#define _CM4_EVENTOUT_PA9_ 1
#define _CM4_EVENTOUT_PB0_ 1
#define _CM4_EVENTOUT_PB1_ 1
#define _CM4_EVENTOUT_PB2_ 1
#define _CM4_EVENTOUT_PB3_ 1
#define _CM4_EVENTOUT_PB4_ 1
#define _CM4_EVENTOUT_PB5_ 1
#define _CM4_EVENTOUT_PB6_ 1
#define _CM4_EVENTOUT_PB7_ 1
#define _CM4_EVENTOUT_PB8_ 1
#define _CM4_EVENTOUT_PB9_ 1
#define _CM4_EVENTOUT_PC14_ 1
#define _CM4_EVENTOUT_PC15_ 1
#define _CM4_EVENTOUT_PE4_ 1
#define _CM4_EVENTOUT_PH3_ 1

#define COMP1_OUT_PA0_ PA0,GPIO_AF12
#define COMP1_OUT_PB0_ PB0,GPIO_AF12
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PB0_ 1

#define COMP2_OUT_PA2_ PA2,GPIO_AF12
#define COMP2_OUT_PA7_ PA7,GPIO_AF12
#define COMP2_OUT_PB5_ PB5,GPIO_AF12
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PA7_ 1
#define _COMP2_OUT_PB5_ 1

#define CRS_SYNC_PA10_ PA10,GPIO_AF10
#define _CRS_SYNC_PA10_ 1

#define EXT_PA_TX_PB0_ PB0,GPIO_AF6
#define _EXT_PA_TX_PB0_ 1

#define I2C1_SCL_PA9_ PA9,GPIO_AF4
#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PA9_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA10_ PA10,GPIO_AF4
#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PA10_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PA1_ PA1,GPIO_AF4
#define I2C1_SMBA_PA14_ PA14,GPIO_AF4
#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PA1_ 1
#define _I2C1_SMBA_PA14_ 1
#define _I2C1_SMBA_PB5_ 1

#define I2C3_SCL_PA7_ PA7,GPIO_AF4
#define _I2C3_SCL_PA7_ 1

#define I2C3_SDA_PB4_ PB4,GPIO_AF4
#define _I2C3_SDA_PB4_ 1

#define I2C3_SMBA_PB2_ PB2,GPIO_AF4
#define _I2C3_SMBA_PB2_ 1

#define IR_OUT_PA13_ PA13,GPIO_AF8
#define IR_OUT_PB9_ PB9,GPIO_AF8
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1

#define LPTIM1_OUT_PA14_ PA14,GPIO_AF1
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define _LPTIM1_OUT_PA14_ 1
#define _LPTIM1_OUT_PB2_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF14
#define _LPTIM2_ETR_PA5_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF14
#define _LPTIM2_IN1_PB1_ 1

#define LPTIM2_OUT_PA4_ PA4,GPIO_AF14
#define LPTIM2_OUT_PA8_ PA8,GPIO_AF14
#define _LPTIM2_OUT_PA4_ 1
#define _LPTIM2_OUT_PA8_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF8
#define _LPUART1_DE_PB1_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1

#define LPUART1_RX_PA12_ PA12,GPIO_AF8
#define LPUART1_RX_PA3_ PA3,GPIO_AF8
#define _LPUART1_RX_PA12_ 1
#define _LPUART1_RX_PA3_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB5_ PB5,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB5_ 1

#define QUADSPI_BK1_IO0_PB9_ PB9,GPIO_AF10
#define _QUADSPI_BK1_IO0_PB9_ 1

#define QUADSPI_BK1_IO1_PB8_ PB8,GPIO_AF10
#define _QUADSPI_BK1_IO1_PB8_ 1

#define QUADSPI_BK1_IO2_PA7_ PA7,GPIO_AF10
#define _QUADSPI_BK1_IO2_PA7_ 1

#define QUADSPI_BK1_IO3_PA6_ PA6,GPIO_AF10
#define _QUADSPI_BK1_IO3_PA6_ 1

#define QUADSPI_BK1_NCS_PA2_ PA2,GPIO_AF10
#define _QUADSPI_BK1_NCS_PA2_ 1

#define QUADSPI_CLK_PA3_ PA3,GPIO_AF10
#define _QUADSPI_CLK_PA3_ 1

#define RCC_LSCO_PA2_ PA2,GPIO_AF0
#define RCC_LSCO_PH3_ PH3,GPIO_AF0
#define _RCC_LSCO_PA2_ 1
#define _RCC_LSCO_PH3_ 1

#define RCC_MCO_PA15_ PA15,GPIO_AF6
#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PB6_ PB6,GPIO_AF0
#define _RCC_MCO_PA15_ 1
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PB6_ 1

#define SAI1_CK1_PA3_ PA3,GPIO_AF3
#define SAI1_CK1_PB8_ PB8,GPIO_AF3
#define _SAI1_CK1_PA3_ 1
#define _SAI1_CK1_PB8_ 1

#define SAI1_CK2_PA8_ PA8,GPIO_AF3
#define _SAI1_CK2_PA8_ 1

#define SAI1_D1_PA10_ PA10,GPIO_AF3
#define _SAI1_D1_PA10_ 1

#define SAI1_D2_PA9_ PA9,GPIO_AF3
#define SAI1_D2_PB9_ PB9,GPIO_AF3
#define _SAI1_D2_PA9_ 1
#define _SAI1_D2_PB9_ 1

#define SAI1_DI1_PA10_ PA10,GPIO_AF3
#define _SAI1_DI1_PA10_ 1

#define SAI1_DI2_PA9_ PA9,GPIO_AF3
#define SAI1_DI2_PB9_ PB9,GPIO_AF3
#define _SAI1_DI2_PA9_ 1
#define _SAI1_DI2_PB9_ 1

#define SAI1_EXTCLK_PA0_ PA0,GPIO_AF13
#define SAI1_EXTCLK_PB2_ PB2,GPIO_AF13
#define _SAI1_EXTCLK_PA0_ 1
#define _SAI1_EXTCLK_PB2_ 1

#define SAI1_FS_A_PA9_ PA9,GPIO_AF13
#define SAI1_FS_A_PB9_ PB9,GPIO_AF13
#define _SAI1_FS_A_PA9_ 1
#define _SAI1_FS_A_PB9_ 1

#define SAI1_FS_B_PA14_ PA14,GPIO_AF13
#define SAI1_FS_B_PA4_ PA4,GPIO_AF13
#define SAI1_FS_B_PB6_ PB6,GPIO_AF13
#define _SAI1_FS_B_PA14_ 1
#define _SAI1_FS_B_PA4_ 1
#define _SAI1_FS_B_PB6_ 1

#define SAI1_MCLK_A_PA3_ PA3,GPIO_AF13
#define SAI1_MCLK_A_PB8_ PB8,GPIO_AF13
#define _SAI1_MCLK_A_PA3_ 1
#define _SAI1_MCLK_A_PB8_ 1

#define SAI1_MCLK_B_PB4_ PB4,GPIO_AF13
#define _SAI1_MCLK_B_PB4_ 1

#define SAI1_SCK_A_PA8_ PA8,GPIO_AF13
#define _SAI1_SCK_A_PA8_ 1

#define SAI1_SCK_B_PB3_ PB3,GPIO_AF13
#define _SAI1_SCK_B_PB3_ 1

#define SAI1_SD_A_PA10_ PA10,GPIO_AF13
#define _SAI1_SD_A_PA10_ 1

#define SAI1_SD_B_PA13_ PA13,GPIO_AF13
#define SAI1_SD_B_PA5_ PA5,GPIO_AF13
#define SAI1_SD_B_PB5_ PB5,GPIO_AF13
#define _SAI1_SD_B_PA13_ 1
#define _SAI1_SD_B_PA5_ 1
#define _SAI1_SD_B_PB5_ 1

#define SPI1_MISO_PA11_ PA11,GPIO_AF5
#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define _SPI1_MISO_PA11_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA12_ PA12,GPIO_AF5
#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define _SPI1_MOSI_PA12_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PB2_ PB2,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PB2_ 1

#define SPI1_SCK_PA1_ PA1,GPIO_AF5
#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define _SPI1_SCK_PA1_ 1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SYS_JTCK_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO_SWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO_SWO_PB3_ 1

#define SYS_JTMS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13_ 1

#define SYS_JTRST_PB4_ PB4,GPIO_AF0
#define _SYS_JTRST_PB4_ 1

#define TIM16_BKIN_PB5_ PB5,GPIO_AF14
#define _TIM16_BKIN_PB5_ 1

#define TIM16_CH1_PA6_ PA6,GPIO_AF14
#define TIM16_CH1_PB8_ PB8,GPIO_AF14
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB8_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF14
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BKIN_PA10_ PA10,GPIO_AF14
#define TIM17_BKIN_PB4_ PB4,GPIO_AF14
#define _TIM17_BKIN_PA10_ 1
#define _TIM17_BKIN_PB4_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF14
#define TIM17_CH1_PB9_ PB9,GPIO_AF14
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB9_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF14
#define _TIM17_CH1N_PB7_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF12
#define TIM1_BKIN_PB7_ PB7,GPIO_AF3
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB7_ 1

#define TIM1_BKIN2_PA11_ PA11,GPIO_AF12
#define _TIM1_BKIN2_PA11_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define _TIM1_CH1_PA8_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define _TIM1_CH2_PA9_ 1

#define TIM1_CH2N_PB8_ PB8,GPIO_AF1
#define _TIM1_CH2N_PB8_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define _TIM1_CH3_PA10_ 1

#define TIM1_CH3N_PB9_ PB9,GPIO_AF1
#define _TIM1_CH3N_PB9_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define _TIM1_CH4_PA11_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define _TIM1_ETR_PA12_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define _TIM2_CH3_PA2_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define _TIM2_CH4_PA3_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF14
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define UART1_CK_PB5_ PB5,GPIO_AF7
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PB5_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define UART1_CTS_PB4_ PB4,GPIO_AF7
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PB4_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define UART1_DE_PB3_ PB3,GPIO_AF7
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PB3_ 1

#define UART1_NSS_PA11_ PA11,GPIO_AF7
#define UART1_NSS_PB4_ PB4,GPIO_AF7
#define _UART1_NSS_PA11_ 1
#define _UART1_NSS_PB4_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define UART1_RTS_PB3_ PB3,GPIO_AF7
#define _UART1_RTS_PA12_ 1
#define _UART1_RTS_PB3_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CTS_PA6_ PA6,GPIO_AF8
#define _UART2_CTS_PA6_ 1

#define UART2_DE_PB1_ PB1,GPIO_AF8
#define _UART2_DE_PB1_ 1

#define UART2_RTS_PB1_ PB1,GPIO_AF8
#define _UART2_RTS_PB1_ 1

#define UART2_RX_PA12_ PA12,GPIO_AF8
#define UART2_RX_PA3_ PA3,GPIO_AF8
#define _UART2_RX_PA12_ 1
#define _UART2_RX_PA3_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF8
#define UART2_TX_PB5_ PB5,GPIO_AF8
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PB5_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define USART1_CK_PB5_ PB5,GPIO_AF7
#define _USART1_CK_PA8_ 1
#define _USART1_CK_PB5_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define USART1_CTS_PB4_ PB4,GPIO_AF7
#define _USART1_CTS_PA11_ 1
#define _USART1_CTS_PB4_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define USART1_DE_PB3_ PB3,GPIO_AF7
#define _USART1_DE_PA12_ 1
#define _USART1_DE_PB3_ 1

#define USART1_NSS_PA11_ PA11,GPIO_AF7
#define USART1_NSS_PB4_ PB4,GPIO_AF7
#define _USART1_NSS_PA11_ 1
#define _USART1_NSS_PB4_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define USART1_RTS_PB3_ PB3,GPIO_AF7
#define _USART1_RTS_PA12_ 1
#define _USART1_RTS_PB3_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USB_DM_PA11_ PA11,GPIO_AF10
#define _USB_DM_PA11_ 1

#define USB_DP_PA12_ PA12,GPIO_AF10
#define _USB_DP_PA12_ 1

#define USB_NOE_PA13_ PA13,GPIO_AF10
#define _USB_NOE_PA13_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */